JMeter-test/test-results/report-100/statistics.json
{
  "获取帖子列表" : {
    "transaction" : "获取帖子列表",
    "sampleCount" : 159492,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 120.11092719384109,
    "medianResTime" : 134.0,
    "minResTime" : 11.0,
    "maxResTime" : 260.0,
    "pct1ResTime" : 150.0,
    "pct2ResTime" : 156.0,
    "pct3ResTime" : 167.0,
    "throughput" : 531.8509675504616,
    "receivedKBytesPerSec" : 3182.643682384638,
    "sentKBytesPerSec" : 100.76082783670857
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 478319,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 56.42426915928463,
    "medianResTime" : 31.0,
    "minResTime" : 3.0,
    "maxResTime" : 260.0,
    "pct1ResTime" : 142.0,
    "pct2ResTime" : 148.0,
    "pct3ResTime" : 160.9900000000016,
    "throughput" : 1595.0293616467866,
    "receivedKBytesPerSec" : 6584.102498027343,
    "sentKBytesPerSec" : 269.4778694507155
  },
  "获取帖子详情" : {
    "transaction" : "获取帖子详情",
    "sampleCount" : 159420,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 23.364540208255168,
    "medianResTime" : 26.0,
    "minResTime" : 3.0,
    "maxResTime" : 116.0,
    "pct1ResTime" : 33.0,
    "pct2ResTime" : 35.0,
    "pct3ResTime" : 41.0,
    "throughput" : 531.7828836762469,
    "receivedKBytesPerSec" : 404.400696496269,
    "sentKBytesPerSec" : 81.53311790739332
  },
  "获取审核帖子列表" : {
    "transaction" : "获取审核帖子列表",
    "sampleCount" : 159407,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 25.766076772036556,
    "medianResTime" : 28.0,
    "minResTime" : 4.0,
    "maxResTime" : 120.0,
    "pct1ResTime" : 35.0,
    "pct2ResTime" : 38.0,
    "pct3ResTime" : 45.0,
    "throughput" : 531.7412928685083,
    "receivedKBytesPerSec" : 2998.1687176901705,
    "sentKBytesPerSec" : 87.23880586123963
  }
}